app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "title"], ["text", "text"], ["created_at", "2017-08-27 02:50:12.413872"], ["updated_at", "2017-08-27 02:50:12.413872"]]
---
	def create
		# render plain: params[:article].inspect
		@article = Article.new(article_params)

		@article.save